import React from 'react';

const nbaBangkok = ['กรุงเทพมหานคร'];
const nbaCentral = [
  'ชัยนาท',
  'นนทบุรี',
  'ปทุมธานี',
  'พระนครศรีอยุธยา',
  'ลพบุรี',
  'สมุทรปราการ',
  'สระบุรี',
  'สิงห์บุรี',
  'อ่างทอง',
  'จันทบุรี',
  'ฉะเชิงเทรา',
  'ชลบุรี',
  'ตราด',
  'นครนายก',
  'ปราจีนบุรี',
  'ระยอง',
  'สระแก้ว',
  'กาญจนบุรี', // zone7
  'ราชบุรี', // zone7
  'สมุทรสาคร', // zone7
  'สุพรรณบุรี' // zone7
];
const nbaNorthEast = [
  'ชัยภูมิ',
  'นครราชสีมา',
  'บุรีรัมย์',
  'ยโสธร',
  'ศรีสะเกษ',
  'สุรินทร์',
  'อำนาจเจริญ',
  'อุบลราชธานี',
  'กาฬสินธุ์',
  'ขอนแก่น',
  'นครพนม',
  'มหาสารคาม',
  'มุกดาหาร',
  'ร้อยเอ็ด',
  'สกลนคร',
  'หนองคาย',
  'หนองบัวลำภู',
  'อุดรธานี',
  'เลย',
  'บึงกาฬ'
];
const nbaNorth = [
  'น่าน',
  'พะเยา',
  'ลำปาง',
  'ลำพูน',
  'เชียงราย',
  'เชียงใหม่',
  'แพร่',
  'แม่ฮ่องสอน',
  'กำแพงเพชร',
  'ตาก',
  'นครสวรรค์',
  'พิจิตร',
  'พิษณุโลก',
  'สุโขทัย',
  'อุตรดิตถ์',
  'อุทัยธานี',
  'เพชรบูรณ์'
];
const nbaSouth = [
  'กระบี่',
  'ชุมพร',
  'นครศรีธรรมราช',
  'พังงา',
  'ภูเก็ต',
  'ระนอง',
  'สุราษฎร์ธานี',
  'ตรัง',
  'นราธิวาส',
  'ปัตตานี',
  'พัทลุง',
  'ยะลา',
  'สงขลา',
  'สตูล',
  'นครปฐม', // zone 7
  'ประจวบคีรีขันธ์', // zone 7
  'สมุทรสงคราม', // zone 7
  'เพชรบุรี' // zone 7
];

export default function AddEGONBA(req) {
  //   console.log(req);
  //   return (
  //     <div>AddEGONBA</div>
  //   )
}
